package com.example.recipes.repository

import com.example.recipes.R
import com.example.recipes.model.Ingredient
import com.example.recipes.model.Recipe

object RecipesRepository {
    val recipes = listOf(
        Recipe(
            name = "Смажена молода картопля",
            description = "Ароматна молода картопля з підсмаженою скоринкою зовні і ніжною, трохи солодкуватою м'якоттю всередині.",
            image = R.drawable.recipe_1,
            ingredients = mutableListOf(
                Ingredient(
                    name = "молода картопля дрібна",
                    weight = "0,5 кг"
                ),
                Ingredient(
                    name = "Кріп",
                    weight = "0,5 пучка"
                ),
                Ingredient(
                    name = "Сіль",
                    weight = "0,5 ч.л"
                ),
                Ingredient(
                    name = "Перець чорний свежомолотий",
                    weight = "0,5 ч.л"
                ),
                Ingredient(
                    name = "Олія для смаження",
                    weight = ""
                )
            ),
            steps = mutableListOf(
                "Ароматна молода картопля з підсмаженою скоринкою зовні і ніжною, трохи солодкуватою м'якоттю всередині. Начебто все просто, але є дрібниці, які забезпечать успіх цієї страви з використанням мінімальної кількості олії. Раджу їх не ігнорувати і тоді результат буде завжди незрівнянним.",
                "Ця страва з розряду тих, у яких потрібно попередньо ретельно підготувати всі продукти, а потім уже все готується досить швидко.",
                "Картоплю беремо дрібну. Не більший за волоський горіх. Найскладніше це її почистити. В принципі можна не чистити, а дуже добре його помити. Але мої домашні вважають за краще все-таки почищену картоплю. Раджу при чищенні одягнути рукавички, щоб не почорніли пальці.Почищену картоплю добре промиваємо. Наразі дуже важливий момент. Картоплю необхідно дуже добре просушити паперовими рушниками. Це для гарної золотистої скоринки.",
                "Тепер підготуємо спеції. З кропу обриваємо листочки. Часник чистим. У моїй родині всі люблять часник, тому я його беру чимало. А так кожен хай бере на свій смак.Часник та кріп дрібно рубаємо.Змішуємо разом і поки що відставляємо.",
                "Тепер готуємо перечно-сольову пудру. Беремо одну-дві чайні ложки солі та чорний перець горошком за смаком. Для дітей перець не можна додавати.Перетираємо сіль та перець у ступці в пудру. Якщо немає ступки, то для отримання сольової пудри можна скористатися кавомолкою і додати чорний мелений перець. Але свіжомелений - завжди набагато краще.",
                "У принципі, все готове і можна приступати до смаження. Для цього нам потрібна глибока сковорода чи сотейник із кришкою. Кришка тут також обов'язкова. Сотейник у мене старенький і бачив види, так, що заздалегідь перепрошую його зовнішній вигляд, але він для приготування цієї страви підходить ідеально. Наливаємо на дно рослинну олію шаром близько 0,5 см. Не більше. Добре розігріваємо олію.",
                "Кидаємо туди картоплю, накриваємо сотейник кришкою і добре перетрушуємо, щоб картопля повністю покрилася олією. НЕ СОЛИТИ!!!!!!!! Це також важливо. Сіль сприяє виділенню соку і в нас може вийти каша.Смажимо на середньому вогні під кришкою, періодично перетрушуючи сотейник. Спочатку картопля буде дзвінко стукати об стінки сотейника при перетрушуванні, потім звук буде дедалі глухім. Це важко описати, але коли смажитимете – зрозумієте. Готовність перевіряємо дерев'яною шпажкою чи ножем.",
                "Коли картопля буде готова - солимо її перечно-сольової пудрою і засипаємо зелень з часником. Все добре перемішуємо, знову накриваємо кришкою і даємо настоятися 5 хвилин.",
                "Все! Можна насолоджуватися ніжною картопелькою!Смачного!"
            ),
            cookingTime = "30 хвилин"
        )
    )
}